### Essential basic functionality

In [1]:
import pandas as pd
import numpy as np

In [2]:
#data 
index = pd.date_range("1/1/2023", periods= 8)
index

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08'],
              dtype='datetime64[ns]', freq='D')

In [3]:
#criando dataframe com as data como indice
df_datas = pd.DataFrame(np.random.randn(8,3), index = index, columns= ["colA","colB","colC"])
df_datas

                colA      colB      colC
2023-01-01  0.175802  0.041266 -0.084386
2023-01-02 -0.146410  0.118150 -0.060297
2023-01-03  0.938153 -1.540685  1.128919
2023-01-04 -0.059740 -1.443870 -0.833111
2023-01-05  1.233164  0.804490  1.153710
2023-01-06 -0.933165  0.667786 -1.408091
2023-01-07  0.153441 -0.275242  0.929354
2023-01-08  1.645802 -0.702899  0.585514

In [4]:
#Atribuir novos nomes para as colunas 
df_datas.columns = ["1","2","3"]

df_datas

                   1         2         3
2023-01-01  0.175802  0.041266 -0.084386
2023-01-02 -0.146410  0.118150 -0.060297
2023-01-03  0.938153 -1.540685  1.128919
2023-01-04 -0.059740 -1.443870 -0.833111
2023-01-05  1.233164  0.804490  1.153710
2023-01-06 -0.933165  0.667786 -1.408091
2023-01-07  0.153441 -0.275242  0.929354
2023-01-08  1.645802 -0.702899  0.585514

In [5]:
#Atribuir novos nomes para as colunas 
df_datas.columns = [int(x) + 10 for x in df_datas.columns]
df_datas

                  11        12        13
2023-01-01  0.175802  0.041266 -0.084386
2023-01-02 -0.146410  0.118150 -0.060297
2023-01-03  0.938153 -1.540685  1.128919
2023-01-04 -0.059740 -1.443870 -0.833111
2023-01-05  1.233164  0.804490  1.153710
2023-01-06 -0.933165  0.667786 -1.408091
2023-01-07  0.153441 -0.275242  0.929354
2023-01-08  1.645802 -0.702899  0.585514

In [6]:
#comando shape
df_datas.shape

(8, 3)

In [7]:
#columns e index
print(df_datas.columns)
print(df_datas.index)
df_datas.dtypes

Index([11, 12, 13], dtype='int64')
DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08'],
              dtype='datetime64[ns]', freq='D')

11    float64
12    float64
13    float64
dtype: object

In [8]:
#caso precise de um numpy

df_datas.to_numpy()

array([[ 0.17580233,  0.04126592, -0.08438573],
       [-0.14640996,  0.11815034, -0.06029705],
       [ 0.93815264, -1.54068457,  1.12891925],
       [-0.05974036, -1.44387023, -0.83311077],
       [ 1.23316406,  0.80449006,  1.1537099 ],
       [-0.93316453,  0.66778585, -1.40809084],
       [ 0.15344144, -0.27524164,  0.92935449],
       [ 1.64580247, -0.70289897,  0.58551382]])

### Metodos add(), sub(), mul(), div(), radd(), rsub(), rsub().

In [9]:
df = pd.DataFrame(
    {
    "flexao": pd.Series(np.random.randint(10,51,3),index = ["dia 1", "dia 2","dia 3"]),
    "abdominal": pd.Series(np.random.randint(10,51,4), index = ["dia 1", "dia 2","dia 3","dia 4"], dtype= float),
    "supino": pd.Series(np.random.randint(10,51,3), index = ["dia 2","dia 3","dia 4"])
    })
df

       flexao  abdominal  supino
dia 1    32.0       40.0     NaN
dia 2    37.0       47.0    42.0
dia 3    11.0       26.0    26.0
dia 4     NaN       41.0    40.0

sub()

In [10]:
#linha do dia 2
row = df.iloc[1]
#subtrair de todas as colunas da tabela
df.sub(row, axis = 1)

       flexao  abdominal  supino
dia 1    -5.0       -7.0     NaN
dia 2     0.0        0.0     0.0
dia 3   -26.0      -21.0   -16.0
dia 4     NaN       -6.0    -2.0

In [11]:
# dia 1 - dia 2
df2 = df.copy()
df2.iloc[0] =  df.iloc[0] - df.iloc[1]
df2

       flexao  abdominal  supino
dia 1    -5.0       -7.0     NaN
dia 2    37.0       47.0    42.0
dia 3    11.0       26.0    26.0
dia 4     NaN       41.0    40.0

In [12]:
#criar uma linha com o a soma das colunas 
soma = df.sum(axis=0)
soma

flexao        80.0
abdominal    154.0
supino       108.0
dtype: float64

In [13]:
#armazenando a soma na linha 'total'
df_total = df. copy()
df.loc["Total"] = soma
df_total

       flexao  abdominal  supino
dia 1    32.0       40.0     NaN
dia 2    37.0       47.0    42.0
dia 3    11.0       26.0    26.0
dia 4     NaN       41.0    40.0

In [14]:
#criar coluna com o total é mais simples, lembrando quese tiver algum valor nulo pode dar problema
df_total["Total"] = df_total["flexao"] + df_total["abdominal"] + df_total["supino"]
df_total

       flexao  abdominal  supino  Total
dia 1    32.0       40.0     NaN    NaN
dia 2    37.0       47.0    42.0  126.0
dia 3    11.0       26.0    26.0   63.0
dia 4     NaN       41.0    40.0    NaN

### operations  with fill  values

In [15]:
df + df

       flexao  abdominal  supino
dia 1    64.0       80.0     NaN
dia 2    74.0       94.0    84.0
dia 3    22.0       52.0    52.0
dia 4     NaN       82.0    80.0
Total   160.0      308.0   216.0

add()

In [16]:
#Aqui preenchemos os valores ausentes no daframe selecionado com o valor da operação
df.add(100, fill_value=0)

       flexao  abdominal  supino
dia 1   132.0      140.0   100.0
dia 2   137.0      147.0   142.0
dia 3   111.0      126.0   126.0
dia 4   100.0      141.0   140.0
Total   180.0      254.0   208.0

### Operações envolvendo binário

##### eq, ne, lt, gt, le, ge

In [17]:
# eq: Retorna True para elementos iguais e False para elementos diferentes.
# ne: Retorna True para elementos diferentes e False para elementos iguais.
# lt: Retorna True para elementos menores e False para elementos maiores ou iguais.
# gt: Retorna True para elementos maiores e False para elementos menores ou iguais.
# le: Retorna True para elementos menores ou iguais e False para elementos maiores.
# ge: Retorna True para elementos maiores ou iguais e False para elementos menores.

In [18]:
#tabela com valores boleanos.
index = ["dia 1","dia 2", "dia 3", "dia 4","dia 5","dia 6"]
df_bool = pd.DataFrame({"flexao":[0,1,0,1,0,1], "abdominal":[0,1,0,1,1,1],"supino":[1,0,0,0,0,0]}, index = index, dtype= bool)
df_bool

       flexao  abdominal  supino
dia 1   False      False    True
dia 2    True       True   False
dia 3   False      False   False
dia 4    True       True   False
dia 5   False       True   False
dia 6    True       True   False

In [19]:
df_negative_bool = -df_bool
df_negative_bool

       flexao  abdominal  supino
dia 1    True       True   False
dia 2   False      False    True
dia 3    True       True    True
dia 4   False      False    True
dia 5    True      False    True
dia 6   False      False    True

In [20]:
#eq = retorna True para os valores iguais
df_bool.eq(df_negative_bool)

       flexao  abdominal  supino
dia 1   False      False   False
dia 2   False      False   False
dia 3   False      False   False
dia 4   False      False   False
dia 5   False      False   False
dia 6   False      False   False

In [21]:
#ne= oposto do eq
df_bool.ne(df_negative_bool)

       flexao  abdominal  supino
dia 1    True       True    True
dia 2    True       True    True
dia 3    True       True    True
dia 4    True       True    True
dia 5    True       True    True
dia 6    True       True    True

### reduções : empty, any(), all(), and bool()

In [34]:
df

       flexao  abdominal  supino
dia 1    32.0       40.0     NaN
dia 2    37.0       47.0    42.0
dia 3    11.0       26.0    26.0
dia 4     NaN       41.0    40.0
Total    80.0      154.0   108.0

In [23]:
# Analisa se todos os valores da coluna são maiores que Zero
(df>0).all()

flexao       False
abdominal     True
supino       False
dtype: bool

In [24]:
# Analisa se existe algum valor maior que zero
(df>0).any()

flexao       True
abdominal    True
supino       True
dtype: bool

In [25]:
#analisar se existe algum elemento vazio
df.empty

False

In [26]:
pd.DataFrame(columns=["a","b","c"]).empty

True

In [29]:
#ver se os dataframes são iguais
(df + df).equals(df *2)

True

In [40]:
#Preencher valores ausentes
df_fillna = df.fillna(0)
df_fillna

       flexao  abdominal  supino
dia 1    32.0       40.0     0.0
dia 2    37.0       47.0    42.0
dia 3    11.0       26.0    26.0
dia 4     0.0       41.0    40.0
Total    80.0      154.0   108.0

In [41]:
#usar um tabela para tapar os valores ausentes da primeiras
df.combine_first(df_fillna)

       flexao  abdominal  supino
dia 1    32.0       40.0     0.0
dia 2    37.0       47.0    42.0
dia 3    11.0       26.0    26.0
dia 4     0.0       41.0    40.0
Total    80.0      154.0   108.0

In [52]:
# dividir em quantis 
print(df["flexao"].quantile(q =0.25))
print(df["flexao"].quantile(q =0.5))
print(df["flexao"].quantile(q =0.75))

26.75
34.5
47.75

In [53]:
df

       flexao  abdominal  supino
dia 1    32.0       40.0     NaN
dia 2    37.0       47.0    42.0
dia 3    11.0       26.0    26.0
dia 4     NaN       41.0    40.0
Total    80.0      154.0   108.0

In [55]:
#drop linha
df = df.drop(index="Total")
df

       flexao  abdominal  supino
dia 1    32.0       40.0     NaN
dia 2    37.0       47.0    42.0
dia 3    11.0       26.0    26.0
dia 4     NaN       41.0    40.0

#### cumsum(), cumprod()

In [56]:
df.cumsum()

       flexao  abdominal  supino
dia 1    32.0       40.0     NaN
dia 2    69.0       87.0    42.0
dia 3    80.0      113.0    68.0
dia 4     NaN      154.0   108.0

In [57]:
df.cumprod()

        flexao  abdominal   supino
dia 1     32.0       40.0      NaN
dia 2   1184.0     1880.0     42.0
dia 3  13024.0    48880.0   1092.0
dia 4      NaN  2004080.0  43680.0

In [59]:
#dispersão da média
print(df.mean())
df.sem()

flexao       26.666667
abdominal    38.500000
supino       36.000000
dtype: float64

flexao       7.965202
abdominal    4.444097
supino       5.033223
dtype: float64

In [66]:
#retorna os valores unicos, ignora os nulos
series_na = pd.Series([2,3,4,5,5])
series_na[0] = np.nan
series_na.nunique()

3

In [ ]:
import statsmodels.formula.api as sm

bb = pd.read_csv("data/baseball.csv", index_col="id")

(
    bb.query("h > 0")
    .assign(ln_h=lambda df: np.log(df.h))
    .pipe((sm.ols, "data"), "hr ~ ln_h + year + g + C(lg)")
    .fit()
    .summary()
)